src/InformationRegisters/ДатыЗакрытияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗакрытияЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДатыЗакрытияЗаявок/Ext/ManagerModule.bsl
Процедура Добавить(Заявка, ДатаЗакрытия, ОбновлятьДатуЗакрытия = Ложь) Экспорт
	
	Если Не ОбновлятьДатуЗакрытия Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗакрытияЗаявок.ДатаЗакрытия
		|ИЗ
		|	РегистрСведений.ДатыЗакрытияЗаявок КАК ДатыЗакрытияЗаявок
		|ГДЕ
		|	ДатыЗакрытияЗаявок.Заявка = &Заявка";
		
		Запрос.УстановитьПараметр("Заявка", Заявка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	МЗ = РегистрыСведений.ДатыЗакрытияЗаявок.СоздатьМенеджерЗаписи();
	МЗ.Заявка 		= Заявка;
	МЗ.ДатаЗакрытия = ДатаЗакрытия;
	МЗ.Записать();
	
КонецПроцедуры
